#include "pch.h"
#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
    cout << "+---------------------------+\n"
		<< "|    О Б Ъ Я В Л Е Н И Е    |\n"
		<< "|                           |\n"
		<< "|     Строится ковчег!      |\n"
		<< "|      тел.: 14-88-14       |\n"
		<< "|                           |\n"
		<< "+------+------+------+------+\n"
		<< "|      |      |      |      |\n"
		<< "|  14  |  14  |  14  |  14  |\n"
		<< "|   -  |   -  |   -  |   -  |\n"
		<< "|  88  |  88  |  88  |  88  |\n"
		<< "|   -  |   -  |   -  |   -  |\n"
		<< "|  14  |  14  |  14  |  14  |\n"
		<< "|      |      |      |      |\n"
		<< "+------+------+------+------+"
		<< endl; 
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
